# Notes for Chapter 5

# Getting Started with pandas

***

pandas is another widely used open source python library. It contains data structures and data manipulation tools designed to make data cleaning and analysis fast and east in Python. pandas is often used in tandem with numerical computing tools like NumPy and Scipy, analytical libraries like statsmodels and scikit-learn, and data visualization libraries like matplotlib.

Pandas adopts many coding idioms from NumPy, but the biggest difference is that pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast is best suited for working with homogeneous numerical array data.

Convention of import pandas:

In [1]:
import pandas as pd

***

## 5.1 Introduction to pandas Data Structures

The two mainly used data structures are: Series and DataFrame. They provide a sold, easy to use basis for most applications.

### Series

A Series is a one-dimensional array like object containing a sequence of values and an associated array of data labels, called its index. The creation of series:

In [2]:
obj = pd.Series([1, 2, 3, 4, 5])

In [3]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

The Values on the left hand side are the index to the actual data on the right hand side. Index is auto generated if not specified.

The default indexing are integers that starts at 0 to n-1 (where n is the length of data). We can get the array representation and index object of the Series via its values and index attributes, respectively:

In [4]:
obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

Specifying custom index in the series looks like this:

In [6]:
obj2 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])

In [7]:
obj2

a     5
b     6
c     7
d     8
e     9
f    10
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

Similar to NumPy arrays, we can use these index to select or set values as required.

In [9]:
obj2['a']

5

In [10]:
obj2['b'] = 11

In [11]:
obj2[['b', 'c', 'd']]

b    11
c     7
d     8
dtype: int64

Here ['b', 'c', 'd'] is interpreted as a list of indices, even though it contains
strings instead of integers.

Using NumPY function or NumPy like operations does not change the index-value link in the data.

In [12]:
obj2[obj2>0]

a     5
b    11
c     7
d     8
e     9
f    10
dtype: int64

In [13]:
obj2 * 2

a    10
b    22
c    14
d    16
e    18
f    20
dtype: int64

In [14]:
import numpy as np

In [15]:
np.exp(obj2)

a      148.413159
b    59874.141715
c     1096.633158
d     2980.957987
e     8103.083928
f    22026.465795
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you mightuse a dict:

In [16]:
'b' in obj2

True

In [17]:
'z' in obj2

False

The data stored in Python dict, can be converted to a Series like so:

In [18]:
a_dict = \
{'football': 500, 'Cricket ball': 100, 'volleyball': 600, 'basketball': 700}

In [19]:
obj3 = pd.Series(a_dict)

In [20]:
obj3

football        500
Cricket ball    100
volleyball      600
basketball      700
dtype: int64

When passing the dict in the series, the key of the dict will be the index in the resulting Series. We can override this by passing in the order we want them to appear in the resulting Series:

In [21]:
balls = ['baseball', 'football', 'Cricket ball', 'basketball']

In [22]:
obj4 = pd.Series(a_dict, index=balls)

In [23]:
obj4

baseball          NaN
football        500.0
Cricket ball    100.0
basketball      700.0
dtype: float64

Since, no value for the 'baseball' was found in the dict provided; the values appears NaN(not a number), which is considered in pandas to mark missing or NA values.

__isnull__ and __notnull__ functions are used in pandas to detect the missing data.

In [24]:
pd.isnull(obj4)

baseball         True
football        False
Cricket ball    False
basketball      False
dtype: bool

In [25]:
pd.notnull(obj4)

baseball        False
football         True
Cricket ball     True
basketball       True
dtype: bool

In [26]:
pd.isna(obj4) #extra .isna function to detect missing values.

baseball         True
football        False
Cricket ball    False
basketball      False
dtype: bool

Series also supports these as instance methods:

In [27]:
obj4.isnull()

baseball         True
football        False
Cricket ball    False
basketball      False
dtype: bool

A useful Series feature for many applications is that it automatically aligns by index
label in arithmetic operations:

In [28]:
obj3

football        500
Cricket ball    100
volleyball      600
basketball      700
dtype: int64

In [29]:
obj4

baseball          NaN
football        500.0
Cricket ball    100.0
basketball      700.0
dtype: float64

In [30]:
obj3 + obj4

Cricket ball     200.0
baseball           NaN
basketball      1400.0
football        1000.0
volleyball         NaN
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality

In [31]:
obj4.name = 'prices'

In [32]:
obj4.index.name = 'balls'

In [33]:
obj4

balls
baseball          NaN
football        500.0
Cricket ball    100.0
basketball      700.0
Name: prices, dtype: float64

A Series's index can be modified in-place by assignment:

In [34]:
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [35]:
obj.index = ['one', 'two', 'three', 'four', 'five']

In [36]:
obj

one      1
two      2
three    3
four     4
five     5
dtype: int64

***

### DataFrame

DataFrame in general can be understood as two dimensional array like object. The dataFrame has both row and column index. A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).

There are many ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy arrays:

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
         'year': [2000, 2001, 2002, 2001, 2002, 2003],
         'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

In [38]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
# head() functions selects top five rows for large dataFrames.

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

DataFrame's columns can be arranged in desired way, by specifying the sequence of columns:

In [40]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If a non existing columns are passed; the values will appear as missing values/ NaN :

In [41]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [42]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [45]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

<span style='color:red'>Note:</span>frame2[column] works for any column name, but frame2.column only works when the column name is a valid Python variable name.

Rows can also be retrieved by position or name with the special __loc__ attribute

In [47]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

Columns assignment:

In [49]:
frame2['debt'] = 11

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    11
two    2001    Ohio  1.7    11
three  2002    Ohio  3.6    11
four   2001  Nevada  2.4    11
five   2002  Nevada  2.9    11
six    2003  Nevada  3.2    11

In [51]:
frame2['debt'] = np.arange(6.)

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any holes:

In [53]:
val = pd.Series([100, 200, 300], index=['two', 'four', 'five'])

In [54]:
frame2['debt'] = val

In [55]:
frame2

       year   state  pop   debt
one    2000    Ohio  1.5    NaN
two    2001    Ohio  1.7  100.0
three  2002    Ohio  3.6    NaN
four   2001  Nevada  2.4  200.0
five   2002  Nevada  2.9  300.0
six    2003  Nevada  3.2    NaN

Assigning a column that does not exits will create a new column. The __del__ keyword can be used to delete the columns like with a dict.

In [56]:
frame2['eastern'] = frame2.state == 'ohio'

In [57]:
frame2

       year   state  pop   debt  eastern
one    2000    Ohio  1.5    NaN    False
two    2001    Ohio  1.7  100.0    False
three  2002    Ohio  3.6    NaN    False
four   2001  Nevada  2.4  200.0    False
five   2002  Nevada  2.9  300.0    False
six    2003  Nevada  3.2    NaN    False

New columns cannot be created with the frame2.eastern syntax.

Use of __del__ method to remove the column:

In [58]:
del frame2['eastern']

In [59]:
frame2

       year   state  pop   debt
one    2000    Ohio  1.5    NaN
two    2001    Ohio  1.7  100.0
three  2002    Ohio  3.6    NaN
four   2001  Nevada  2.4  200.0
five   2002  Nevada  2.9  300.0
six    2003  Nevada  3.2    NaN

If a nested dict is passed on to the DataFrame, then pandas will interpret the outer dict keys as the columns and the inner keys as the row indices:

In [60]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [61]:
frame3 = pd.DataFrame(pop)

In [62]:
frame3

      Nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

We can Transpose the DataFrame similar to NumPy arrays:

In [63]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

Setting upo the name attributes for index and column's of the DataFrame:

In [64]:
frame3.index.name = 'year'

In [65]:
frame3.columns.name = 'state'

In [66]:
frame3

state  Nevada  ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

only the values can be retrieved using __values__ attribute. The data contained in dataFrame is shown as 2-D ndarray:

In [67]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [68]:
frame2

       year   state  pop   debt
one    2000    Ohio  1.5    NaN
two    2001    Ohio  1.7  100.0
three  2002    Ohio  3.6    NaN
four   2001  Nevada  2.4  200.0
five   2002  Nevada  2.9  300.0
six    2003  Nevada  3.2    NaN

If the DataFrame’s columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the columns:

In [69]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, 100.0],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, 200.0],
       [2002, 'Nevada', 2.9, 300.0],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

***

### Index Objects

Index objects in pandas holds axis labels and other metadata(like the axis name or names). Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index:

Index objects are immutable, thus cannot be modified:

In [70]:
obj = pd.Series(range(3), index=['zero', 'one', 'two'])

In [71]:
index = obj.index

In [72]:
index

Index(['zero', 'one', 'two'], dtype='object')

In [73]:
index[1:]

Index(['one', 'two'], dtype='object')

In [74]:
index[1] = 'hello' # is immutable thus throws TypeError

TypeError: Index does not support mutable operations

Being immutable, Index objects can be shared among data structures:

In [75]:
labels = pd.Index(np.arange(3))

In [76]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [77]:
obj2 = pd.Series([12, 13, 14], index=labels)

In [78]:
obj2

0    12
1    13
2    14
dtype: int64

In [79]:
obj2.index is labels

True

In addition to being array-like, an Index also behaves like a fixed-size set:

In [80]:
frame3

state  Nevada  ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [81]:
frame3.columns

Index(['Nevada', 'ohio'], dtype='object', name='state')

In [82]:
'ohio' in frame3.columns

True

In [83]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64', name='year')

In [84]:
2001 in frame3.index

True

In [85]:
2100 in frame3.index

False

a pandas Index can contain duplicate lables, unlike sets in Python:

In [86]:
dup_labels = pd.Index(['one', 'one', 'two'])

In [87]:
dup_labels

Index(['one', 'one', 'two'], dtype='object')

Selections with duplicate labels will select all occurrences of that label

***

## 5.2 Essential Functionality

### Reindexing

Reindexing in pandas is to create a new object with the data conformed to a new index. Consider an example:

In [89]:
obj = pd.Series(np.arange(5), index=list('abcde'))

In [90]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

calling reindex on this series rearranges the data according to the new index, introducing missing values if any index values were not already present:

In [91]:
obj.reindex(list('bcdefa'))

b    1.0
c    2.0
d    3.0
e    4.0
f    NaN
a    0.0
dtype: float64

__method__ option allows us to do filling of values when reindexing using method such as __ffill__, which forward fills the values:

In [92]:
obj2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2 ,4])

In [93]:
obj2

0      blue
2    purple
4    yellow
dtype: object

In [94]:
obj2.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In DataFrame, reindex can alter either row or column or both. When passed only a sequence, it reindexes the rows in the result:

In [96]:
df = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [97]:
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [98]:
df2 = df.reindex(['a', 'b', 'c', 'd'])

In [99]:
df2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

By default, the reindexing is done in the rows but for the columns; coulmns keyword can be used:

In [100]:
states = ['Texas', 'California', 'Washington']

In [101]:
df.reindex(columns=states)

   Texas  California  Washington
a      1           2         NaN
c      4           5         NaN
d      7           8         NaN

***

### Dropping Entries from an Axis

__drop__ method can be used to delete  the values from an axis:

In [103]:
obj3 = pd.Series(np.arange(5.), index=list('abcde'))

In [104]:
obj3

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [105]:
new_obj = obj.drop('c')

In [106]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [107]:
obj3.drop(list('ab'))

c    2.0
d    3.0
e    4.0
dtype: float64

In [108]:
obj3

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

drop method created a new object with the indicated values to be deleted, hence not affecting the original object.

With DataFrame, index value can be deleted from  either axis. To illustrate this, we first create an example DataFrame:

In [116]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],\
                    columns=['one', 'two', 'three', 'four'])

In [117]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Calling __drop__ with a sequence of labels will drop values from the row labels (axis 0):

In [118]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

We can do same in the columns section by passing axis=1 or axis='columns':

In [119]:
data.drop('two', axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [120]:
data.drop(['one', 'three'], axis=1)

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

by default, function like drop will create a new object with modified changes but they can manipulate an original object in-place without returning a new object.

In [122]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
data.drop('Ohio', inplace=True)

In [124]:
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Be careful with the inplace, as it destroys any data that is dropped.

***

### Indexing, Selection and Filtering

Series indexing works similar to the NumPy array indexing, except we can use the Series's index value instead of only integers.

In [128]:
obj = pd.Series(np.arange(4.), index=list('abcd'))

In [129]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [130]:
obj['b']

1.0

In [132]:
obj[1]

1.0

In [133]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [134]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [135]:
obj[[0, -1]]

a    0.0
d    3.0
dtype: float64

In [136]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

__Slicing with labels__ behaves differently than normal Python slicing in that the endpoint is inclusive.

In [137]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [138]:
obj['b':'d'] = 999

In [139]:
obj

a      0.0
b    999.0
c    999.0
d    999.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequece:

In [141]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [142]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [143]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [144]:
data[['one', 'four', 'three']]

          one  four  three
Ohio        0     3      2
Colorado    4     7      6
Utah        8    11     10
New York   12    15     14

In [145]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [146]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

In [152]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [153]:
data[data < 5] = 0

In [154]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

It is another use case in indexing with boolean dataFrame.

#### Selection with loc and iloc

__loc__ and __iloc__ are special operators for DataFrame label-indexing on the rows. They enable you to select a subset of the rows and columns from a DataFrame with NumPy-like notation using either axis labels (loc) or integers (iloc).

In [157]:
data.loc['Colorado', ['one', 'two']]

one    0
two    5
Name: Colorado, dtype: int32

For integers, we use iloc in similar manner.

In [158]:
data.iloc[2, [3, 1]]

four    11
two      9
Name: Utah, dtype: int32

In [159]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [160]:
data.iloc[[1, 2], [2, 3]]

          three  four
Colorado      6     7
Utah         10    11

Both indexing functions work with slices in addition to single labels or lists of labels:

In [161]:
data.loc[:'Utah', 'two':]

          two  three  four
Ohio        0      0     0
Colorado    5      6     7
Utah        9     10    11

In [166]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

***

### Integer Indexes

In [168]:
sr = pd.Series(np.arange(3.))

In [169]:
sr

0    0.0
1    1.0
2    2.0
dtype: float64

In [173]:
# it will throw error because of integer indexing.

#sr[-1]

On the other hand, with a non-integer index, there is no potential for ambiguity:

In [174]:
ser2 = pd.Series(np.arange(6), index=list('abcdef'))

In [176]:
ser2[-1]

5

Thus, for more precise data handling use loc(for labels) or iloc (for integers):

In [185]:
sr.iloc[-1]

2.0

In [183]:
sr.loc[:2]

0    0.0
1    1.0
2    2.0
dtype: float64

***

### Arithmetic and Data Alignment

An important pandas feature for some applications is the behavior of arithmetic between objects with different indexes. When we are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.

In [195]:
s1 = pd.Series(np.arange(1, 5), index=['a', 'c', 'd', 'e'])

In [196]:
s2 = pd.Series(np.arange(5, 10), index=list('acefg'))

In [197]:
s1

a    1
c    2
d    3
e    4
dtype: int32

In [198]:
s2

a    5
c    6
e    7
f    8
g    9
dtype: int32

In [199]:
s1 + s2

a     6.0
c     8.0
d     NaN
e    11.0
f     NaN
g     NaN
dtype: float64

Missing Values are assigned with the lables that do not overlap or exist in both of the series added; by the internal data alignment.

In case of DataFrame, alignment is performed on both the rows and the columns:

In [202]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                     index=['Ohio', 'Texas', 'Colorado'])

In [203]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [204]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [205]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Adding these together returns a DataFrame whose index and columns are the unions
of the ones in each DataFrame:

In [206]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear as all missing in the result. The same holds for the rows whose labels are not common to both objects.

If we add DataFrame objects with no row labels or columns in common, the result will contain all nulls:

In [215]:
df3 = pd.DataFrame({'A': [1, 2]})

In [216]:
df4 = pd.DataFrame({'B': [3, 4]})

In [218]:
df3

   A
0  1
1  2

In [219]:
df4

   B
0  3
1  4

In [217]:
df3 + df4

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill Values:

In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other:

In [220]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))

In [221]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [222]:
df2.loc[1, 'b'] = np.nan

In [223]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [224]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Adding these together results in NA values in the locations that don’t overlap:

In [225]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the __add__ method of df1, we pass df2 and an argument to __fill_value__:

In [226]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

When reindexing a Series or DataFrame, we can also specify fill values :

In [229]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series:

Operations between DataFrame and Series is similar to the operation in different dimensional arrays. consider this example of opertion of a 2D array and one of its row.

In [231]:
arr = np.arange(9).reshape((3, 3))

In [232]:
arr

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [233]:
arr[0]

array([0, 1, 2])

In [234]:
arr - arr[0]

array([[0, 0, 0],
       [3, 3, 3],
       [6, 6, 6]])

When we subtract arr[0] from arr, the subtraction is performed once for each row. This is referred to as broadcasting in NumPy.  Operations between a DataFrame and a Series are
similar:

In [235]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [236]:
series = frame.iloc[0]

In [237]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [238]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series on the DataFrame’s columns, broadcasting down the rows:

In [239]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union:

In [240]:
sr2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [244]:
sr2

b    0
e    1
f    2
dtype: int64

In [243]:
frame + sr2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods. For example:

In [245]:
series3 = frame['d']

In [247]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [248]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [249]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis number that we pass is the axis to match on. In this case we mean to match on the DataFrame’s row index (axis='index' or axis=0) and broadcast across.

***

### Function Application and Mapping

ufuncs(element-wise array methods) from NumPy also work with pandas object:

In [250]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [251]:
frame

               b         d         e
Utah    0.548783 -0.509435 -1.652368
Ohio    0.281948 -0.503150 -2.131951
Texas  -0.709556  0.031813 -0.159012
Oregon  1.537823  1.291343 -1.010350

In [252]:
np.abs(frame)

               b         d         e
Utah    0.548783  0.509435  1.652368
Ohio    0.281948  0.503150  2.131951
Texas   0.709556  0.031813  0.159012
Oregon  1.537823  1.291343  1.010350

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame’s apply method does exactly this:

In [253]:
f = lambda x: x.max() - x.min()

In [255]:
frame.apply(f)

b    2.247379
d    1.800777
e    1.972939
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

If we pass axis='columns' to apply, the function will be invoked once per row
instead:

In [256]:
frame.apply(f, axis='columns')

Utah      2.201151
Ohio      2.413900
Texas     0.741369
Oregon    2.548173
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

The function passed to apply need not return a scalar value; it can also return a Series
with multiple values:

In [259]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [260]:
frame.apply(f)

            b         d         e
min -0.709556 -0.509435 -2.131951
max  1.537823  1.291343 -0.159012

***

### Sorting and Ranking

To sort naturally by row or column index, we can use __sort_index__ method, which returns a new, sorted object:

In [261]:
obj = pd.Series(range(4), index=list('cdae'))

In [262]:
obj

c    0
d    1
a    2
e    3
dtype: int64

In [263]:
obj.sort_index()

a    2
c    0
d    1
e    3
dtype: int64

In DataFrame, we can sort by index on either axis:

In [264]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                     columns=list('dabc'))

In [265]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [266]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be sorted in descending order, too:

In [267]:
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

We can use __sort_values__ method to sort a series by its values:

In [273]:
obj = pd.Series(np.arange(10, 5, -1))

In [274]:
obj

0    10
1     9
2     8
3     7
4     6
dtype: int32

In [275]:
obj.sort_values()

4     6
3     7
2     8
1     9
0    10
dtype: int32

Any missing values are sorted to the end of the Series by default:

In [276]:
obj = pd.Series([1, np.nan, 5, np.nan, 3, np.nan])

In [277]:
obj

0    1.0
1    NaN
2    5.0
3    NaN
4    3.0
5    NaN
dtype: float64

In [278]:
obj.sort_values()

0    1.0
4    3.0
2    5.0
1    NaN
3    NaN
5    NaN
dtype: float64

When sorting a DataFrame, we can use the data in one or more columns as the sort keys. To do so, pass one or more column names to the by option of sort_values:

In [282]:
df = pd.DataFrame({'b': [4, 7, -2, -3], 'a': [0, 1, 0, 1]})

In [283]:
df

   b  a
0  4  0
1  7  1
2 -2  0
3 -3  1

In [284]:
df.sort_values(by='a')

   b  a
0  4  0
2 -2  0
1  7  1
3 -3  1

In [287]:
df.sort_values(by='b')

   b  a
3 -3  1
2 -2  0
0  4  0
1  7  1

In [286]:
df.sort_values(by=['a', 'b'])

   b  a
2 -2  0
0  4  0
3 -3  1
1  7  1

##### ranking concepts can be checked from the official documentation

***

### Axis Indexes with Duplicate Labels

Up until now all of the examples we’ve looked at have had unique axis labels (index values). While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [289]:
obj = pd.Series(range(5), index=list('aabbc'))

In [290]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [291]:
obj.index.is_unique

False

This index's __is_unique__ property cann tell whether all of its labels are unique or not.

The major issues arises in data selection with duplicate labels. Indexing a label with multiple entries returns a Series, while single entries return a scalar value:

In [292]:
obj['a']

a    0
a    1
dtype: int64

In [293]:
obj['c']

4

This can rise the complexity in the programs, as the output type from indexing can vary based on whether a label is repeated or not.

In [294]:
df = pd.DataFrame(np.random.randn(4, 3), index=list('aabb'))

In [295]:
df

          0         1         2
a -0.554244  0.297524  0.672185
a -1.251613  0.298239 -1.293007
b -0.804973 -0.435019  0.052166
b -1.615059 -0.574436  0.842699

In [296]:
df.loc['b']

          0         1         2
b -0.804973 -0.435019  0.052166
b -1.615059 -0.574436  0.842699

***

## 5.3 Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. Compared with the similar methods found on NumPy arrays, they have built-in handling for missing data. Consider a small DataFrame:

In [298]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [299]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame’s sum method returns a Series containing column sums:

In [300]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis='columns' or axis=1 sums across the columns instead:

In [305]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA.
This can be disabled with the __skipna__ option:

In [303]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods, like __idxmin__ and __idxmax__, return indirect statistics like the index value
where the minimum or maximum values are attained:

In [306]:
df.idxmax()

one    b
two    d
dtype: object

In [307]:
df.idxmin()

one    d
two    b
dtype: object

Other methods are accumulations:

In [308]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. __describe__ is one such method that produces multiple summary statistics in one shot:

In [309]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

__describe__ method produces alternative summary stats on Non-numeric data.

In [310]:
obj = pd.Series(list('aabc') * 4)

In [311]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

***

### Unique Values, Value Counts and Membership

Another class of related methods extracts information about the values contained in a one-dimensional Series. For example:

In [315]:
obj = pd.Series(list('cadaabbcc'))

In [316]:
uniques = obj.unique()

In [317]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The __unique__ functions gives an array of the unique values in a Series.

The unique value returned are not necessarily in sorted order but can be sorted explicitly if neeeded (uniques.sort()). similarly, __value_counts__ computes a Series containing value frequencies:

In [322]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

__isin__ performs a vectorized set membership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:

In [326]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [327]:
mask = obj.isin(['b', 'c'])

In [328]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [329]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Similarly, another method Index.get_indexer gives an index array from an array of possibly non-distinct values into another array of distinct values:

In [330]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [331]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [332]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [333]:
unique_vals

0    c
1    b
2    a
dtype: object

In [343]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)